Repository: Belerafon/CookaReq
Catalog: app/locale/*/LC_MESSAGES/CookaReq.po
Languages: ru

source: Preferred method to prove compliance: inspection, analysis, demonstration or test. Selecting a method early guides preparation of verification activities and needed tools. It also clarifies expectations for acceptance.
ru: Предпочитаемый метод подтверждения выполнения: инспекция, анализ, демонстрация или испытание. Выбор метода заранее направляет подготовку проверочных мероприятий и необходимых инструментов. Он также уточняет ожидания по приемке.

source: Explanation of why the requirement exists or how it was derived. Capturing rationale preserves design intent and helps future maintainers understand trade-offs. This background is valuable during change discussions or audits.
ru: Обоснование, почему требование необходимо или как оно было выведено. Фиксация мотивации сохраняет замысел и помогает будущим участникам понимать сделанные компромиссы. Этот контекст полезен при обсуждении изменений и во время аудитов.

source: Assumptions made while formulating the requirement, such as available technologies or expected user behavior. Listing assumptions exposes risks and clarifies the context that might change. Revisit them regularly to ensure the requirement remains valid.
ru: Предположения, сделанные при формулировке требования, например о доступных технологиях или поведении пользователей. Указание предположений выявляет риски и проясняет контекст, который может измениться. Периодически пересматривайте их, чтобы требование оставалось актуальным.

source: risk decisions transparent and supports future recalculations.
ru: Укажите дополнительный ресурс или допуск, который покрывает неопределённости. Фиксация запасов делает решения по рискам прозрачными и помогает при последующих пересчётах.

source: Show Trace Matrix
ru: Показать матрицу трассировки

source: Trace Matrix
ru: Матрица трассировки

source: Child
ru: Потомок

source: No links found
ru: Связи не найдены

source: (top-level)
ru: (верхний уровень)

source: ...and {count} more.
ru: ...и ещё {count}.

source: Automatically reopen the most recently used requirements folder on startup. Disable to always choose a folder manually.
ru: Автоматически открывать при запуске последнюю использованную папку требований. Отключите, чтобы каждый раз выбирать папку вручную.

source: Clear history
ru: Очистить историю

source: Clear suspect mark
ru: Снять пометку подозрения

source: Custom labels (comma-separated)
ru: Произвольные метки (через запятую)

source: Delete document {prefix} and its subtree?
ru: Удалить документ {prefix} и все дочерние элементы?

source: Delete item {rid}?
ru: Удалить требование {rid}?

source: Delete {count} requirements?
ru: Удалить {count} записей требований?

source: Discard unsaved changes?
ru: Отменить несохранённые изменения?

source: Document not found
ru: Документ не найден

source: Document prefix is required.
ru: Требуется указать префикс документа.

source: Documents
ru: Документы

source: Edit label
ru: Изменить метку

source: Edit...
ru: Изменить...

source: Failed to load requirements folder "{path}": {error}
ru: Не удалось загрузить папку требований "{path}": {error}

source: Failed to load requirements for document "{prefix}": {error}
ru: Не удалось загрузить требования для документа "{prefix}": {error}

source: Hide hierarchy
ru: Скрыть иерархию

source: Invalid requirement ID
ru: Некорректный идентификатор требования

source: JSON list of attachments
ru: JSON-список вложений

source: JSON template file
ru: JSON-шаблон

source: Key
ru: Ключ

source: Count
ru: Количество

source: Language for menus and dialogs. Changes apply after restarting CookaReq.
ru: Язык для меню и диалогов. Изменения вступят в силу после перезапуска CookaReq.

source: Mark as suspect
ru: Пометить как подозрительное

source: Max output tokens
ru: Макс. токенов в ответе

source: Max retries
ru: Макс. число повторов

source: Maximum number of tokens returned by the model. Example: 4096 Minimum allowed value is 1000 tokens; CookaReq defaults to 5000 when unset.
ru: Максимальное число токенов, возвращаемых моделью. Пример: 4096 Минимально допустимое значение — 1000 токенов; по умолчанию CookaReq использует 5000, если поле пустое.

source: New document
ru: Новый документ

source: Number of times to retry a failed HTTP request. Example: 3 Optional; defaults to 3 retries.
ru: Сколько раз повторять неуспешный HTTP-запрос. Пример: 3 Необязательное поле; по умолчанию выполняется 3 попытки.

source: Prefix
ru: Префикс

source: Prefix must start with a capital letter and contain only letters, digits or underscores.
ru: Префикс должен начинаться с заглавной буквы и содержать только буквы, цифры или подчёркивания.

source: Query
ru: Запрос

source: Remember the last column and direction used to sort requirements. Keeps the list ordering consistent between sessions.
ru: Запоминать последний столбец и направление сортировки требований. Позволяет сохранять порядок списка между сеансами.

source: Edit document
ru: Изменить документ

source: Requirement {rid}
ru: Требование {rid}

source: Requirement {rid} already exists
ru: Требование {rid} уже существует

source: Requirement {rid}: {title}
ru: Требование {rid}: {title}

source: Show Requirement Editor
ru: Показать редактор требований

source: Show hierarchy
ru: Показать иерархию

source: Stream
ru: Потоковый вывод

source: Stream partial responses from the LLM as they arrive. Disable to wait for the full reply before showing it.
ru: Передавать частичные ответы LLM по мере поступления. Отключите, чтобы ждать полного ответа перед отображением.

source: Suspect link
ru: Подозрительная связь

source: Timeout (min)
ru: Таймаут (мин)

source: aborted
ru: прервано

source: attachments must be a list
ru: вложения должны быть списком

source: comma-separated labels
ru: метки через запятую

source: comma-separated parent requirement IDs
ru: идентификаторы родительских требований через запятую

source: create document
ru: создать документ

source: create new item
ru: создать новый элемент

source: delete document
ru: удалить документ

source: delete item
ru: удалить элемент

source: document not found: {prefix}
ru: документ не найден: {prefix}

source: document prefix
ru: префикс документа

source: document title
ru: название документа

source: edit existing item
ru: изменить существующий элемент

source: export trace links
ru: экспортировать связи трассировки

source: invalid link target: {rid}
ru: неверная цель связи: {rid}

source: invalid requirement identifier: {rid}
ru: некорректный идентификатор требования: {rid}

source: item not found: {rid}
ru: элемент не найден: {rid}

source: item statement
ru: описание элемента

source: item title
ru: название элемента

source: labels must be a list
ru: метки должны быть списком

source: link requirements
ru: связать требования

source: linked item not found: {rid}
ru: связанный элемент не найден: {rid}

source: links must be a list
ru: связи должны быть списком

source: list documents
ru: список документов

source: manage documents
ru: управлять документами

source: manage items
ru: управлять элементами

source: move item
ru: переместить элемент

source: export data
ru: экспортировать данные

source: export requirements
ru: экспортировать требования

source: document prefixes (comma separated)
ru: префиксы документов через запятую

source: title for exported document
ru: заголовок экспортируемого документа

source: Requirements export
ru: Экспорт требований

source: output format
ru: формат вывода

source: parent document prefix
ru: префикс родительского документа

source: parent requirement identifiers
ru: идентификаторы родительских требований

source: replace existing links instead of adding
ru: заменить существующие связи вместо добавления

source: requirement identifier
ru: идентификатор требования

source: requirement not found: {rid}
ru: требование не найдено: {rid}

source: requirements root
ru: корневая папка требований

source: revision must be an integer
ru: ревизия должна быть целым числом

source: show what would be deleted
ru: показать, что будет удалено

source: target document prefix
ru: префикс целевого документа

source: unknown document prefix: {prefix}
ru: неизвестный префикс документа: {prefix}

source: unknown priority: {value}
ru: неизвестный приоритет: {value}

source: unknown requirement type: {value}
ru: неизвестный тип требования: {value}

source: unknown status: {value}
ru: неизвестный статус: {value}

source: unknown verification method: {value}
ru: неизвестный метод проверки: {value}

source: write result to file
ru: записать результат в файл

source: &New Requirement Ctrl+N
ru: &Новое требование Ctrl+N

source: aborted
ru: прервано

source: document not found: {prefix}
ru: документ не найден: {prefix}

source: invalid link target: {rid}
ru: неверная цель связи: {rid}

source: invalid requirement identifier: {rid}
ru: некорректный идентификатор требования: {rid}

source: item not found: {rid}
ru: элемент не найден: {rid}

source: linked item not found: {rid}
ru: связанный элемент не найден: {rid}

source: requirement not found: {rid}
ru: требование не найдено: {rid}

source: unknown document prefix: {prefix}
ru: неизвестный префикс документа: {prefix}

source: Arguments:
ru: Аргументы:

source: Call ID: {value}
ru: Идентификатор вызова: {value}

source: Error details:
ru: Подробности ошибки:

source: Extra fields:
ru: Дополнительные поля:

source: Result payload:
ru: Результат:

source: [{index}] {name} — Status: {status}
ru: [{index}] {name} — Статус: {status}

source: (empty)
ru: (пусто)

source: === Interaction {index} ===
ru: === Взаимодействие {index} ===

source: Agent
ru: Агент

source: Agent response:
ru: Ответ агента:

source: Cancel
ru: Отмена

source: Chats
ru: Чаты

source: Context messages:
ru: Контекстные сообщения:

source: Conversation ID: {conversation_id}
ru: Идентификатор беседы: {conversation_id}

source: Copy
ru: Копировать

source: Copy conversation
ru: Скопировать переписку

source: Copy message
ru: Скопировать сообщение

source: Copy selection
ru: Скопировать выделенное

source: Copy technical log
ru: Скопировать технический лог

source: Could not open log folder: %s
ru: Не удалось открыть каталог с логами: %s

source: Created at: {timestamp}
ru: Создано: {timestamp}

source: Delete chat
ru: Удалить чат

source: Delete chat "{title}"?
ru: Удалить чат «{title}»?

source: Delete selected chats
ru: Удалить выбранные чаты

source: Delete {count} selected chats?
ru: Удалить {count} выбранных чатов?

source: Directory for MCP request logs. Example: /var/log/cookareq Leave empty to store logs in the standard application log folder.
ru: Каталог для логов запросов MCP. Например: /var/log/cookareq Оставьте пустым, чтобы использовать стандартную папку логов приложения.

source: Entries: {count}
ru: Записей: {count}

source: Agent context messages included in LLM request:
ru: Контекстные сообщения агента, добавленные к запросу LLM:

source: Agent → LLM history messages:
ru: Агент → LLM: сообщения истории

source: Agent → LLM compiled request:
ru: Агент → LLM: итоговый запрос

source: Tool specifications are sent as a separate payload and therefore do not appear inside the compiled request messages.
ru: Спецификации инструментов передаются отдельным параметром, поэтому их не видно внутри сообщений собранного запроса.

source: LLM system prompt:
ru: Системный промпт LLM:

source: LLM tool specification:
ru: Спецификация инструментов LLM:

source: Last activity
ru: Последняя активность

source: Log directory
ru: Каталог логов

source: MCP health endpoint returned invalid JSON
ru: Endpoint проверки состояния MCP вернул некорректный JSON

source: MCP server health check failed
ru: Не удалось выполнить проверку состояния сервера MCP

source: MCP server is not reachable at %(host)s:%(port)s
ru: Сервер MCP недоступен по адресу %(host)s:%(port)s

source: Max context tokens
ru: Максимум токенов контекста

source: Maximum number of tokens reserved for the conversation history when sending prompts. Default: {default} tokens. Minimum allowed: {minimum} tokens.
ru: Максимальное число токенов, резервируемых для истории переписки при отправке промптов. По умолчанию: {default} токенов. Минимально допустимо: {minimum} токенов.

source: Messages: {count}
ru: Сообщений: {count}

source: New chat
ru: Новый чат

source: No activity yet
ru: Активность отсутствует

source: No messages yet
ru: Пока нет сообщений

source: Open Log Folder
ru: Открыть папку с логами

source: Prompt timestamp: {timestamp}
ru: Время промпта: {timestamp}

source: LLM → Agent final message:
ru: LLM → Агент: итоговое сообщение

source: User → Agent prompt:
ru: Пользователь → Агент: запрос

source: Agent → User response:
ru: Агент → Пользователь: ответ

source: Agent stored response payload:
ru: Сохранённый ответ агента:

source: Agent reported error payload:
ru: Сообщённая агентом ошибка:

source: Agent raw result payload:
ru: Сырой итоговый пакет агента:

source: Regenerate
ru: Перегенерить

source: Response timestamp: {timestamp}
ru: Время ответа: {timestamp}

source: Restart response generation
ru: Запустить генерацию ответа заново

source: Show Hierarchy
ru: Показать иерархию

source: LLM ↔ MCP tool exchanges:
ru: Обмен инструментов между LLM и MCP:

source: Success
ru: Успешно

source: Summary
ru: Сводка

source: The waiting status shows four elements: • The timer reports how long the agent has been running in mm:ss and updates every second. • The centered bullet (•) separates the timer from the token counter. • The token counter reports the prompt size in thousands of tokens (k tokens); a leading ~ marks an approximate value when the tokenizer cannot provide an exact figure. • The spinning indicator on the left stays active while the agent is still working.
ru: Индикатор ожидания показывает четыре элемента: • Таймер отображает время работы агента в формате мм:сс и обновляется каждую секунду. • Центральная точка (•) отделяет таймер от счётчика токенов. • Счётчик токенов показывает размер промпта в тысячах токенов (k токенов); символ ~ перед значением обозначает приблизительную оценку, когда токенайзер не может дать точное число. • Анимация вращения слева активна, пока агент продолжает работать.

source: This chat does not have any messages yet. Send one to get started.
ru: В этом чате пока нет сообщений. Отправьте сообщение, чтобы начать.

source: Today {time}
ru: Сегодня {time}

source: Tokens: {count}
ru: Токенов: {count}

source: Agent: tool call {index}: {name} — Status: {status}
ru: Агент: вызов инструмента {index}: {name} — Статус: {status}

source: LLM tool call ID: {value}
ru: Идентификатор вызова инструмента LLM: {value}

source: LLM → MCP arguments:
ru: LLM → MCP: аргументы

source: MCP → Agent result payload:
ru: MCP → Агент: результат

source: MCP → Agent error payload:
ru: MCP → Агент: ошибка

source: Additional fields:
ru: Дополнительные поля:

source: Requirement: {rid}
ru: Требование: {rid}

source: Unknown
ru: Неизвестно

source: Unnamed tool
ru: Инструмент без названия

source: Updated at: {timestamp}
ru: Обновлено: {timestamp}

source: Working
ru: Работа

source: Yesterday {time}
ru: Вчера {time}

source: You
ru: Вы

source: not recorded
ru: не записано

source: this chat
ru: этот чат

source: Ask every time
ru: Запрашивать каждый раз

source: Skip for this chat
ru: Не запрашивать для этого чата

source: Never ask
ru: Не запрашивать никогда

source: Confirmations
ru: Подтверждения

source: Set status for selected
ru: Изменить статус выделенных

source: Set status
ru: Изменить статус

source: Set labels…
ru: Изменить метки…

source: &Import Requirements…
ru: &Импорт требований…

source: (Auto)
ru: (Авто)

source: (Ignore)
ru: (Игнорировать)

source: (missing field)
ru: (отсутствует поле)

source: (untitled)
ru: (без названия)

source: <i>Select a file to preview data.</i>
ru: <i>Выберите файл, чтобы посмотреть предварительный просмотр.</i>

source: Agent (step {index}):
ru: Агент (шаг {index}):

source: Agent: tool call {index}: {tool} — {status}
ru: Агент: вызов инструмента {index}: {tool} — {status}

source: Arguments: {value}
ru: Аргументы: {value}

source: Attachments provided: {count}
ru: Переданные вложения: {count}

source: Batch cancellation requested
ru: Отмена пакета запрошена

source: Batch finished: {done} completed, {failed} failed, {cancelled} cancelled
ru: Пакет завершён: {done} выполнено, {failed} с ошибкой, {cancelled} отменено

source: Batch queue
ru: Очередь пакета

source: Errors
ru: Ошибки

source: Tool calls
ru: Вызовы инструментов

source: Requirement edits
ru: Изменения требований

source: Tokens
ru: Токены

source: Batch ready: {total} requirements queued ({pending} pending)
ru: Пакет готов: в очереди {total} требований ({pending} в ожидании)

source: Batch started: {count} requirements
ru: Пакет запущен: {count} требований

source: Batch • {rid}
ru: Пакет • {rid}

source: CSV and TSV files (*.csv;*.tsv)|*.csv;*.tsv|All files|*.*
ru: Файлы CSV и TSV (*.csv;*.tsv)|*.csv;*.tsv|Все файлы|*.*

source: Call identifier: {identifier}
ru: Идентификатор вызова: {identifier}

source: Cancelled
ru: Отменено

source: Children:
ru: Потомки:

source: Choose the conversation envelope used when talking to the model. • OpenAI chat — the classic JSON schema {role, content}. Works with most compatible APIs, supports standard tool_calls, and matches the OpenAI Chat Completions and OpenRouter interfaces. Keep this option when the provider does not document extended formats. • Harmony (GPT-OSS) — a structured protocol with system/developer/user/ assistant/tool roles and analysis/commentary/final channels. Used by the gpt-oss family of models, it separates the chain of thought from the user-facing answer and clearly signals tool invocations. Requires a provider that accepts Harmony tokens (for example, the OpenAI Responses API or a compatible gateway). In streaming mode the model returns a sequence of events that must each be decoded via a Harmony renderer. • Qwen (ChatML + reasoning) — the format for Qwen-R/-MCP models with reasoning_content support. Dialogues are assembled in ChatML syntax (<|im_start|>role ...), and intermediate reasoning plus tool calls arrive directly inside the reasoning stream. CookaReq exposes the option in the UI, but full reasoning-tool support will ship after the Qwen renderer and parser are integrated. Practical guidance: — Always match the selected format with the provider's capabilities. Picking an incompatible protocol results in errors or empty replies. — Harmony and Qwen need dedicated streaming parsers. If streaming is enabled, ensure that the LLM client can decode events for these formats. — When migrating to new models, lock the format in configuration to avoid falling back to OpenAI chat by accident. — When experimenting with Harmony, check that the system prompt enables Reasoning and lists valid channels; otherwise the model may degrade or ignore tool_calls. — After CookaReq updates, review the architecture notes: they track the limitations and support status for each format.
ru: Выберите формат диалога, используемый при общении с моделью. • OpenAI chat — классическая JSON-схема {role, content}. Работает с большинством совместимых API, поддерживает стандартные tool_calls и соответствует интерфейсам OpenAI Chat Completions и OpenRouter. Оставляйте этот вариант, если провайдер не документирует расширенные форматы. • Harmony (GPT-OSS) — структурированный протокол с ролями system/developer/user/assistant/tool и каналами analysis/commentary/final. Им пользуется семейство моделей gpt-oss: протокол отделяет цепочку рассуждений от ответа пользователю и явно помечает обращения к инструментам. Требует провайдера, принимающего токены Harmony (например, OpenAI Responses API или совместимый шлюз). В потоковом режиме модель возвращает последовательность событий, каждое из которых нужно декодировать рендерером Harmony. • Qwen (ChatML + reasoning) — формат для моделей Qwen-R/-MCP с поддержкой reasoning_content. Диалоги собираются в синтаксисе ChatML (<|im_start|>role ...), а промежуточные рассуждения и вызовы инструментов приходят прямо в потоке reasoning. CookaReq показывает опцию в интерфейсе, но полная поддержка reasoning+tools появится после интеграции рендерера и парсера Qwen. Практические рекомендации: — Всегда сопоставляйте выбранный формат с возможностями провайдера. Несовместимый протокол приводит к ошибкам или пустым ответам. — Harmony и Qwen требуют специальных потоковых парсеров. Если включён стриминг, убедитесь, что клиент LLM умеет декодировать события этих форматов. — При миграции на новые модели зафиксируйте формат в конфигурации, чтобы случайно не вернуться к OpenAI chat. — Экспериментируя с Harmony, проверьте, что системный промпт включает Reasoning и перечисляет допустимые каналы; иначе модель может деградировать или игнорировать tool_calls. — После обновлений CookaReq просматривайте архитектурные заметки: в них отражены ограничения и статус поддержки каждого формата.

source: Column
ru: Столбец

source: Column mapping
ru: Сопоставление столбцов

source: Columns document
ru: Документ для столбцов

source: Completed
ru: Завершено

source: Completed at {timestamp}
ru: Завершено в {timestamp}

source: Context
ru: Контекст

source: Copy log output to clipboard
ru: Скопировать вывод логов в буфер обмена

source: Copy logs
ru: Скопировать логи

source: Created requirement: {rid}
ru: Создано требование: {rid}

source: Current attachment count: {count}
ru: Текущих вложений: {count}

source: Current outgoing links: {count}
ru: Текущих исходящих связей: {count}

source: Custom instructions appended to the system prompt: {instructions}
ru: Пользовательские инструкции, добавленные к системному промпту: {instructions}

source: Custom instructions are appended to the agent's system prompt for this project. Use them to encode domain conventions, coding standards or policies the assistant must follow.
ru: Пользовательские инструкции добавляются к системному промпту агента для этого проекта. Используйте их, чтобы зафиксировать доменные соглашения, стандарты кодирования или политики, которым должен следовать помощник.

source: Define project-specific instructions appended to the system prompt.
ru: Задайте проектные инструкции, которые будут добавлены к системному промпту.

source: Delete requirement failed
ru: Не удалось удалить требование

source: Deleted requirement: {rid}
ru: Удалено требование: {rid}

source: Document: {doc}
ru: Документ: {doc}

source: Document: {prefix}
ru: Документ: {prefix}

source: Enable the checkbox to send a fixed sampling temperature to the LLM. When disabled, the temperature parameter is omitted and the provider falls back to its default. Allowed values range from 0 to 2. Lower temperatures produce more deterministic replies, higher values increase variety. Default value: {default}.
ru: Отметьте флажок, чтобы передавать в LLM фиксированную температуру выборки. Без флажка параметр не отправляется, и провайдер использует значение по умолчанию. Допустимые значения — от 0 до 2. Меньшие температуры делают ответы более детерминированными, большие увеличивают разнообразие. Значение по умолчанию: {default}.

source: Enter a prompt before starting a batch
ru: Введите запрос перед запуском пакета

source: Error details: {details}
ru: Подробности ошибки: {details}

source: Error {code}: [{code}]
ru: Ошибка {code}: [{code}]

source: Error {code}: [{code}] {message}
ru: Ошибка {code}: [{code}] {message}

source: Error: {message}
ru: Ошибка: {message}

source: Failed
ru: Ошибка

source: Field delimiter
ru: Разделитель полей

source: Field: {field}
ru: Поле: {field}

source: Filters: {filters}
ru: Фильтры: {filters}

source: First row is a header
ru: Первая строка — заголовок

source: Format
ru: Формат

source: Found {count} issue(s).
ru: Найдено проблем: {count}

source: Harmony (GPT-OSS)
ru: Harmony (GPT-OSS, расширенный протокол)
