Repository: Belerafon/CookaReq
Catalog: app/locale/*/LC_MESSAGES/CookaReq.po
Languages: ru

source: Settings file
ru: Файл настроек

source: Trace Matrix Health Coverage: {linked}/{total} cells ({coverage:.2%}) Suspect cells: {suspect_cells}/{linked} ({suspect_ratio:.2%}) Suspect links: {suspect_links} Orphan rows: {orphan_rows} Orphan columns: {orphan_columns}
ru: Состояние матрицы трассировки Покрытие: {linked}/{total} ячеек ({coverage:.2%}) Подозрительные ячейки: {suspect_cells}/{linked} ({suspect_ratio:.2%}) Подозрительные связи: {suspect_links} Строки без связей: {orphan_rows} Столбцы без связей: {orphan_columns}

source: Trace matrix exported
ru: Матрица трассировки экспортирована

source: Unsupported file extension
ru: Неподдерживаемое расширение файла

source: Use compact cell symbols (·/✓/!)
ru: Использовать компактные символы ячеек (·/✓/!)

source: Verification
ru: Проверка

source: filter by status
ru: фильтр по статусу

source: include linked parent requirement IDs
ru: включать ID связанных родительских требований

source: items per page
ru: элементов на страницу

source: list items
ru: элементы списка

source: none
ru: нет

source: outside exported scope
ru: вне экспортируемой области

source: page number
ru: номер страницы

source: Context documents
ru: Контекстные документы

source: invalid context_docs format
ru: некорректный формат context_docs

source: outside document root: {path}
ru: путь вне корня документа: {path}

source: not a Markdown file: {path}
ru: не Markdown-файл: {path}

source: file not found: {path}
ru: файл не найден: {path}

source: Export finished with missing context files: {details}
ru: Экспорт завершён с отсутствующими контекстными файлами: {details}

source: Context docs
ru: Контекстные документы

source: Generate context_docs content before requirements list
ru: Генерировать содержимое context_docs перед списком требований

source: JSON list of context markdown paths
ru: JSON-список путей к контекстным Markdown-файлам

source: context_docs must be a list
ru: context_docs должен быть списком

source: context_docs must be a list of strings
ru: context_docs должен быть списком строк
