Repository: Belerafon/CookaReq
Catalog: app/locale/*/LC_MESSAGES/CookaReq.po
Languages: ru

source: LLM/Agent
ru: LLM/Агент

source: API base
ru: Адрес API

source: Model
ru: Модель

source: API key
ru: Ключ API

source: Timeout
ru: Таймаут

source: Check LLM
ru: Проверить LLM

source: Check tools
ru: Проверить инструменты

source: not checked
ru: не проверено

source: Agent instructions
ru: Инструкции агента

source: error
ru: ошибка

source: Unknown error
ru: Неизвестная ошибка

source: Requirement
ru: Требование

source: Constraint
ru: Ограничение

source: Interface
ru: Интерфейс

source: Draft
ru: Черновик

source: In review
ru: На рецензии

source: Approved
ru: Согласовано

source: Baselined
ru: Зафиксировано

source: Retired
ru: Снято с применения

source: Rejected
ru: Отклонено

source: Deferred
ru: Отложено

source: Superseded
ru: Заменено

source: Needs clarification
ru: Нужны уточнения

source: Low
ru: Низкий

source: Medium
ru: Средний

source: High
ru: Высокий

source: Not defined
ru: Не определен

source: Inspection
ru: Инспекция

source: Analysis
ru: Анализ

source: Demonstration
ru: Демонстрация

source: Test
ru: Испытание

source: Title
ru: Название

source: Clone
ru: Клонировать

source: Delete
ru: Удалить

source: Edit {field}
ru: Изменить {field}

source: Select {field}
ru: Выберите {field}

source: Select all
ru: Выбрать всё

source: Edit
ru: Редактирование

source: New value for {field}
ru: Новое значение для {field}

source: Requirement ID (number)
ru: Идентификатор требования (число)

source: Short title
ru: Краткое название требования

source: Requirement text
ru: Полный текст требования

source: Acceptance criteria
ru: Критерии приемки требования

source: Conditions
ru: Условия и режимы

source: Requirement revision
ru: Ревизия требования

source: Document prefix
ru: Префикс документа

source: Requirement RID
ru: RID требования

source: Modified at
ru: Дата изменения

source: Owner
ru: Ответственный за требование

source: Source
ru: Источник требования

source: Short uppercase prefix placed at the beginning of every requirement identifier (for example SYS1). It is also used for the document directory name. Identifiers are numbered sequentially without leading zeros (SYS1, SYS2, …). The prefix must start with a capital letter and may contain only ASCII letters, digits or underscores.
ru: Короткий префикс из заглавных букв, который добавляется в начало каждого идентификатора требования (например SYS1). Он также используется в имени каталога документа. Идентификаторы нумеруются последовательно без ведущих нулей (SYS1, SYS2, …). Префикс должен начинаться с заглавной буквы и может содержать только латинские буквы, цифры или символ подчёркивания.

source: Human-friendly document name shown in the navigation tree, window titles and exports. When left empty the title defaults to the prefix.
ru: Человекочитаемое название документа, которое отображается в дереве навигации, заголовках окон и экспортируемых материалах. Если оставить поле пустым, заголовок будет совпадать с префиксом.

source: Parent document that determines where this entry sits in the hierarchy. The top level is shown as '(top-level)'. Select a parent to place the document under it or choose '(top-level)' to keep it at the root.
ru: Родительский документ, определяющий положение записи в иерархии. Верхний уровень отображается как «(top-level)». Выберите родителя, чтобы разместить документ под ним, или оставьте «(top-level)», чтобы оставить его на верхнем уровне.

source: Requirement type
ru: Тип требования

source: Status
ru: Статус

source: Priority
ru: Приоритет исполнения

source: Verification method
ru: Метод проверки

source: Unique integer identifier
ru: Уникальный целочисленный идентификатор

source: Save
ru: Сохранить

source: ID is required
ru: требуется указать идентификатор

source: ID must be an integer
ru: идентификатор должен быть целым числом

source: ID must be positive
ru: идентификатор должен быть положительным

source: Revision must be a positive integer
ru: ревизия должна быть положительным целым числом

source: Hint
ru: Подсказка

source: &Open Folder Ctrl+O
ru: О&ткрыть папку Ctrl+O

source: Open &Recent
ru: Открыть &недавние

source: Settings
ru: Настройки

source: E&xit
ru: В&ыход

source: &File
ru: &Файл

source: Show Log Console
ru: Показать консоль логов

source: Show Agent Chat
ru: Показать чат с агентом

source: Log Console
ru: Консоль логов

source: Log Level
ru: Уровень логов

source: Debug
ru: Отладка

source: Info
ru: Информация

source: Warning
ru: Предупреждение

source: Hierarchy
ru: Иерархия

source: Requirements
ru: Требования

source: Requirements - {document}
ru: Требования - {document}

source: Requirements: {count}
ru: Требований: {count}

source: Requirements: {visible}/{total}
ru: Требований: {visible}/{total}

source: Requirements count: {count}
ru: Количество требований: {count}

source: Document revision: {value}
ru: Ревизия документа: {value}

source: Document revisions
ru: Ревизии документов

source: Editor
ru: Редактор

source: Agent Chat
ru: Чат с агентом

source: &View
ru: &Вид

source: Open
ru: Открыть

source: New
ru: Создать

source: Select requirements folder
ru: Выберите папку требований

source: File was modified on disk. Save cancelled.
ru: Файл был изменён на диске. Сохранение отменено.

source: Error
ru: Ошибка

source: (Copy)
ru: (Копия)

source: rev {revision}
ru: рев. {revision}

source: Open last folder on startup
ru: Открывать последнюю папку при запуске

source: Remember sort order
ru: Запоминать порядок сортировки

source: Language
ru: Язык

source: CookaReq CLI
ru: CLI CookaReq

source: list requirements
ru: перечислить требования

source: requirements directory
ru: каталог требований

source: filter by labels
ru: фильтр по меткам

source: text search query
ru: текстовый запрос

source: fields for text search
ru: поля для текстового поиска

source: add requirement from JSON file
ru: добавить требование из JSON-файла

source: JSON file with requirement
ru: JSON-файл с требованием

source: edit requirement from JSON file
ru: изменить требование по JSON-файлу

source: JSON file with updated requirement
ru: JSON-файл с обновлённым требованием

source: show requirement details
ru: показать детали требования

source: requirement id
ru: идентификатор требования

source: &Tools
ru: &Инструменты

source: (Derived)
ru: (производное)

source: (any)
ru: (любое)

source: (none)
ru: (нет)

source: Add
ru: Добавить

source: Add derived
ru: Добавить производное

source: Add presets
ru: Добавить пресеты

source: Agent Command
ru: Команда агента

source: Any field contains
ru: Любое поле содержит

source: Approved at
ru: Утверждено

source: Assumptions
ru: Допущения

source: Assumptions used during derivation.
ru: Допущения, использованные при выводе.

source: Attachments
ru: Вложения

source: Cancelled by user
ru: Отменено пользователем

source: Check MCP
ru: Проверить MCP

source: Clear
ru: Очистить

source: Clear all
ru: Очистить всё

source: Columns
ru: Колонки

source: Confirm
ru: Подтвердить

source: Delete requirement?
ru: Удалить требование?

source: Delete requirement {summary}?
ru: Удалить требование {summary}?

source: Derivation Graph
ru: Граф выводов

source: Derive
ru: Создать производное

source: Derived from
ru: Получено из

source: Derived only
ru: Только производные

source: Derived count
ru: Количество производных

source: File
ru: Файл

source: Filters
ru: Фильтры

source: Clear filters
ru: Убрать фильтры

source: General
ru: Общее

source: Graphviz 'dot' executable not found.
ru: Не найден исполняемый файл Graphviz 'dot'.

source: Has derived
ru: Имеет производные

source: Host
ru: Хост

source: Install networkx and graphviz to view the derivation graph.
ru: Установите networkx и graphviz для просмотра графа выводов.

source: Label already exists
ru: Метка уже существует

source: Labels
ru: Метки

source: Labels in use will be removed from requirements: %s Continue?
ru: Используемые метки будут удалены из требований: %s Продолжить?

source: Manage Labels
ru: Управление метками

source: Links
ru: Связи

source: Match any labels
ru: Совпадает с любой меткой

source: Name
ru: Имя

source: New name
ru: Новое имя

source: No Data
ru: Нет данных

source: No derivation links found.
ru: Связи вывода не найдены.

source: No requirements loaded
ru: Требования не загружены

source: Note
ru: Примечание

source: Notes
ru: Примечания

source: Parent
ru: Родитель

source: Path
ru: Путь

source: Port
ru: Порт

source: Rationale
ru: Обоснование

source: Reasoning for the derivation.
ru: Обоснование вывода.

source: Relates
ru: Связи

source: Remove
ru: Удалить

source: Remove all labels?
ru: Удалить все метки?

source: Require token
ru: Требуется токен

source: Run
ru: Запустить

source: Open Agent Chat Ctrl+K
ru: Открыть чат с агентом Ctrl+K

source: Select attachment
ru: Выберите вложение

source: Select requirements folder first
ru: Сначала выберите папку требований

source: Select a document first
ru: Сначала выберите документ

source: Set
ru: Установить

source: Show Derivation Graph
ru: Показать граф выводов

source: Start MCP
ru: Запустить MCP

source: Run MCP server when a requirements folder opens
ru: Запускать MCP при открытии директории требований

source: Stop MCP
ru: Остановить MCP

source: Suspect only
ru: Только подозрительные

source: Token
ru: Токен

source: Update requirement?
ru: Обновить требование?

source: (unknown requirement)
ru: (неизвестное требование)

source: Update requirement "{rid}"?
ru: Обновить требование "{rid}"?

source: Directory: {directory}
ru: Каталог: {directory}

source: Expected revision: {revision}
ru: Ожидаемая ревизия: {revision}

source: Planned changes:
ru: Планируемые изменения:

source: {index}. Invalid patch operation
ru: {index}. Некорректная операция патча

source: (missing op)
ru: (операция не указана)

source: Confirm requirement update
ru: Подтвердите обновление требования

source: Always until restart (all requirements)
ru: Всегда до перезапуска (для всех требований)

source: Verifies
ru: Проверяет

source: IDs of requirements this one verifies
ru: ID требований, которые проверяет это требование

source: IDs of related requirements
ru: ID связанных требований

source: IDs of source requirements
ru: ID исходных требований

source: Requirement ID
ru: ID требования

source: check only LLM
ru: проверить только LLM

source: check only MCP
ru: проверить только MCP

source: not running
ru: не запущен

source: running
ru: запущен

source: MCP is a local server providing tools for requirement management used by agents and the LLM.
ru: MCP — локальный сервер, предоставляющий инструменты для управления требованиями, которые используют агенты и LLM.

source: path to JSON/TOML settings
ru: путь к настройкам JSON/TOML

source: ready
ru: готов

source: Chat History
ru: История запросов

source: Conversation
ru: Диалог

source: Ask the agent
ru: Спросите агента

source: Describe what you need the agent to do
ru: Опишите, что должен сделать агент

source: Send
ru: Отправить

source: Clear input
ru: Очистить ввод

source: Attach file…
ru: Прикрепить файл…

source: Select file to attach
ru: Выберите файл для прикрепления

source: All files|*.*|Text files (*.txt)|*.txt
ru: Все файлы|*.*|Текстовые файлы (*.txt)|*.txt

source: Unable to read {path} as UTF-8 text. Only UTF-8 encoded text files are supported.
ru: Не удалось прочитать {path} как текст UTF-8. Поддерживаются только текстовые файлы в кодировке UTF-8.

source: The selected file {path} exceeds the maximum attachment size of 1 MB.
ru: Выбранный файл {path} превышает максимальный размер вложения 1 МБ.

source: The selected file {path} does not appear to be plain text. Please choose a UTF-8 text document.
ru: Выбранный файл {path} не похож на текстовый UTF-8. Пожалуйста, выберите текстовый документ.

source: Attachment error
ru: Ошибка вложения

source: Failed to attach file {path}: {error}
ru: Не удалось прикрепить файл {path}: {error}

source: No file attached
ru: Файл не прикреплён

source: {size} KB
ru: {size} КБ

source: {size}KB
ru: {size}КБ

source: kTok
ru: кТок

source: Attachment: {name} Size: {size} Tokens: {tokens} Context window: {usage}
ru: Вложение: {name} Размер: {size} Токены: {tokens} Контекстное окно: {usage}

source: Stop
ru: Стоп

source: Ready
ru: Готово

source: Waiting for agent… {time} • {tokens}
ru: Ожидание ответа… {time} • {tokens}

source: Received response in {time}
ru: Ответ получен за {time}

source: Received response in {time} • {tokens}
ru: Ответ получен за {time} • {tokens}

source: Generation cancelled
ru: Генерация остановлена

source: Tokens: {tokens}
ru: Токены: {tokens}

source: Start chatting with the agent to see responses here.
ru: Начните чат с агентом, чтобы увидеть ответы здесь.

source: You:
ru: Вы:

source: Agent:
ru: Агент:

source: verify LLM and MCP settings
ru: проверить настройки LLM и MCP

source: Base URL of the LLM API. Example: https://api.openai.com/v1 Required; defines where requests are sent.
ru: Базовый URL LLM API. Пример: https://api.openai.com/v1 Обязательное поле; определяет, куда отправляются запросы.

source: LLM model name. Example: gpt-4-turbo Required; selects which model to use.
ru: Имя модели LLM. Пример: gpt-4-turbo Обязательное поле; определяет используемую модель.

source: LLM access key. Example: sk-XXXX Required when the service needs authentication.
ru: Ключ доступа к LLM. Пример: sk-XXXX Обязателен, если сервис требует авторизации.

source: HTTP request timeout in minutes. Example: 1 Optional; defaults to 60 minutes.
ru: Тайм-аут HTTP-запроса в минутах. Пример: 1 Необязательное поле; по умолчанию 60 минут.

source: Automatically start the MCP server whenever a requirements folder is opened.
ru: Автоматически запускать MCP при открытии директории требований.

source: Hostname for the MCP server. Example: 127.0.0.1 Required; defines where to run the server.
ru: Адрес хоста MCP-сервера. Пример: 127.0.0.1 Обязательное поле; определяет, где запускать сервер.

source: MCP server port. Example: 8123 Required field.
ru: Порт MCP-сервера. Пример: 8123 Обязательное поле.

source: Active requirements folder. CookaReq updates it automatically from the currently opened directory. The value is read-only and shown for reference.
ru: Текущая директория с требованиями. CookaReq подставляет её автоматически из открытой папки. Значение отображается только для справки.

source: When enabled, the server requires an authentication token.
ru: Если включено, сервер требует токен аутентификации.

source: Access token for MCP. Example: secret123 Required when "Require token" is enabled.
ru: Токен доступа для MCP. Пример: secret123 Обязателен, если включено "Требуется токен".

source: Send a test request to the configured LLM using the current settings. Use this to verify credentials and network connectivity.
ru: Отправляет тестовый запрос в настроенную LLM с текущими параметрами. Используйте его, чтобы убедиться в корректности ключей и сетевого соединения.

source: Contact the MCP server with the current connection settings and list the available tools. Ensures the agent integration is configured correctly.
ru: Подключается к серверу MCP с указанными параметрами и запрашивает список доступных инструментов. Помогает убедиться, что интеграция агента настроена правильно.

source: Launch the MCP server in the background using the current connection settings.
ru: Запускает сервер MCP в фоне с текущими параметрами подключения.

source: Stop the MCP server instance that was started from CookaReq.
ru: Останавливает экземпляр сервера MCP, запущенный из CookaReq.

source: Connect to the MCP server and report whether it is reachable. Displays diagnostic information about the running instance.
ru: Подключается к серверу MCP и сообщает, доступен ли он. Показывает диагностическую информацию о работающем экземпляре.

source: Shows whether the MCP server is currently running according to CookaReq and the result of the last check.
ru: Показывает, считает ли CookaReq сервер MCP запущенным, и результат последней проверки.

source: The 'Requirement ID' is a unique integer used as the stable anchor for a requirement. Teams refer to it in traceability matrices, change requests and test reports to ensure everyone talks about the same item. Once the identifier appears in external documents it should not be changed to avoid broken references.
ru: «Идентификатор требования» — устойчивый числовой ключ, по которому элемент прослеживается во всех документах. Им пользуются в матрицах трассируемости, запросах на изменение и отчётах по тестам, чтобы всем было понятно, о каком объекте речь. После публикации во внешних материалах номер изменять нельзя, иначе ссылки станут некорректными.

source: A concise human-readable summary shown in lists and diagrams. It lets stakeholders skim large sets of requirements and quickly find relevant topics. Use clear keywords so search and sorting produce meaningful results.
ru: Краткое человекочитаемое название, отображаемое в списках и диаграммах. Помогает участникам быстро просматривать большие наборы требований и находить нужные темы. Подбирайте понятные ключевые слова, чтобы поиск и сортировка работали эффективно.

source: The full requirement statement describing what the system must do or the constraint it imposes. This wording becomes the authoritative baseline for implementation and contractual obligations. Detailed phrasing here prevents ambiguity during design and review. Keep each statement testable and unambiguous; avoid vague qualifiers such as "as needed" or "when possible" without clear criteria. Prefer one requirement per statement to avoid splitting obligations across multiple thoughts. Markdown is supported: lists, tables, and emphasis can improve readability without changing the core meaning. Reference images as attachments with ![Description](attachment:<id>). Inline formula notation can be written as \(v = s/t\) or $$E = mc^2$$.
ru: Полный текст требования, описывающий, что должна делать система или какое ограничение накладывается. Именно эта формулировка становится официальной базой для реализации и контрактных обязательств. Детальное описание здесь предотвращает двусмысленность при проектировании и рецензировании. Делайте каждую формулировку проверяемой и однозначной; избегайте размытых уточнений вроде «по мере необходимости» или «когда возможно» без чётких критериев. Предпочитайте одно требование на формулировку, чтобы не смешивать несколько обязательств в одном тексте. Поддерживается Markdown: списки, таблицы и выделение повышают читаемость без изменения сути. Изображения добавляйте как вложения по ссылкам ![Описание](attachment:<id>). Встроенные формулы можно писать как \(v = s/t\) или $$E = mc^2$$.

source: Acceptance criteria explain how to verify that the requirement is satisfied. They may include test scenarios, measurable thresholds or review checklists. Well-defined criteria let QA teams plan tests and give product owners a clear basis for acceptance.
ru: Критерии приемки объясняют, как убедиться, что требование выполнено. Это могут быть тестовые сценарии, измеримые пороговые значения или проверочные листы. Чёткие критерии позволяют QA-команде планировать испытания и дают владельцу продукта прозрачное основание для принятия работы.

source: Operating conditions and modes under which the requirement applies. Describe environments, performance ranges or user roles that influence validity. Such context helps engineers design correctly and testers reproduce the right setup.
ru: Условия и режимы, в которых действует требование. Опишите окружения, диапазоны производительности или роли пользователей, влияющие на применимость. Такая информация помогает инженерам правильно спроектировать систему, а тестировщикам воспроизвести нужный контекст.

source: Links to higher-level requirements or stakeholder needs. Upward traceability shows why this requirement exists and simplifies impact analysis when parents change. Use it to prove coverage of system objectives.
ru: Ссылки на более высокоуровневые требования или потребности заказчика. Трассировка вверх показывает, зачем существует данное требование, и облегчает анализ последствий при изменении родительских элементов. Используйте её, чтобы подтвердить покрытие целей системы.

source: Revision number for the requirement baseline. By default CookaReq increments it when the statement text changes. You can also set another positive integer manually before saving if your process requires a specific revision value.
ru: Номер ревизии базовой версии требования. По умолчанию CookaReq увеличивает его, когда изменяется текст формулировки. При необходимости вы также можете вручную задать другое положительное целое число перед сохранением, если в вашем процессе требуется конкретное значение ревизии.

source: Date and time of the last edit. The value is filled automatically and aids audit trails. Reviewers can sort by this field to focus on recently modified items.
ru: Дата и время последнего редактирования. Значение устанавливается автоматически и облегчает ведение журналов изменений. Рецензенты могут сортировать по этому полю, чтобы сосредоточиться на недавно обновлённых элементах.

source: Person or team responsible for the requirement. The owner coordinates discussions, approves updates and answers questions from other stakeholders. Assigning ownership clarifies accountability and speeds up decisions.
ru: Человек или команда, отвечающая за требование. Владелец координирует обсуждения, утверждает правки и отвечает на вопросы других участников. Назначение ответственного проясняет обязанности и ускоряет принятие решений.

source: Origin of the requirement such as a customer request, regulation or design document. Recording the source explains why the requirement exists and where to look for additional context. This trace is essential when validating compliance or revisiting negotiations.
ru: Источник требования: запрос клиента, норматив, проектный документ или запись встречи. Фиксация источника объясняет, почему требование появилось, и куда обратиться за дополнительным контекстом. Это важно при проверке соответствия или повторном анализе исходных договорённостей.

source: Classification of the requirement: functional, constraint, interface or quality attribute. Types help filter large sets, assign specialists and apply different review processes. Consistent categorization improves reporting and reuse.
ru: Классификация требования: функциональное, ограничение, интерфейс или характеристика качества. Тип помогает фильтровать большие массивы, привлекать нужных специалистов и применять разные процессы рецензирования. Последовательная классификация улучшает отчётность и повторное использование.

source: Lifecycle state like draft, in review, approved or retired. The status communicates readiness and controls workflow gates. Dashboards and metrics rely on it to show project progress.
ru: Стадия жизненного цикла: черновик, на рецензии, согласовано, снято и т.п. Статус показывает степень готовности и управляет прохождением контрольных этапов. Панели мониторинга и метрики используют его для отражения прогресса проекта.

source: Relative importance or urgency of the requirement. High-priority items drive planning and resource allocation. Use priority to focus effort on the capabilities that deliver most value.
ru: Относительная важность или срочность требования. Элементы с высоким приоритетом определяют планирование и распределение ресурсов. Приоритизация помогает сосредоточить усилия на функциях, которые дают наибольшую ценность.
