Repository: Belerafon/CookaReq
Catalog: app/locale/*/LC_MESSAGES/CookaReq.po
Languages: ru

source: Import
ru: Импорт

source: Import Requirements
ru: Импорт требований

source: Import blocked
ru: Импорт заблокирован

source: Import completed
ru: Импорт завершён

source: Imported {count} requirement(s).
ru: Импортировано требований: {count}.

source: Invalid arguments for %(tool)s: expected a JSON object but received %(type)s
ru: Некорректные аргументы для %(tool)s: ожидался объект JSON, получен %(type)s

source: Labels cleared
ru: Метки очищены

source: Labels: {labels}
ru: Метки: {labels}

source: Matching requirements: {count}
ru: Подходящих требований: {count}

source: Model reasoning
ru: Рассуждение модели

source: New value: {value}
ru: Новое значение: {value}

source: No
ru: Нет

source: No data
ru: Нет данных

source: No documents found
ru: Документы не найдены

source: No links.
ru: Связей нет.

source: No requirements to import.
ru: Нет требований для импорта.

source: OpenAI chat (default)
ru: OpenAI chat (по умолчанию)

source: Outgoing links cleared
ru: Исходящие связи очищены

source: Outgoing links provided: {count}
ru: Указано исходящих связей: {count}

source: Override temperature
ru: Задать температуру вручную

source: Owner: {owner}
ru: Ответственный: {owner}

source: Parents:
ru: Предки:

source: Pending
ru: В ожидании

source: Preview
ru: Просмотр

source: View
ru: Просмотр

source: Insert image
ru: Вставить изображение

source: Insert table
ru: Вставить таблицу

source: Insert formula
ru: Вставить формулу

source: Insert formula (inline: \(...\), block: $$...$$)
ru: Вставить формулу (встроенная: \(...\), блок: $$...$$)

source: Insert heading
ru: Вставить заголовок

source: Insert bold text
ru: Вставить жирный текст

source: | Column | Value | | --- | --- | | Item | Description |
ru: | Колонка | Значение | | --- | --- | | Элемент | Описание |

source: # Heading
ru: # Заголовок

source: **Bold text**
ru: **Жирный текст**

source: Previous value: {value}
ru: Предыдущее значение: {value}

source: Priority: {priority}
ru: Приоритет: {priority}

source: Query: {query}
ru: Запрос: {query}

source: Qwen (ChatML + reasoning)
ru: Qwen (ChatML + reasoning, поток рассуждений)

source: Raw data
ru: Сырые данные

source: Raw response payload
ru: Исходный ответ

source: Ready to import {imported} requirement(s) from {total} data row(s). Skipped {skipped}.
ru: Готово к импорту {imported} требований из {total} строк данных. Пропущено: {skipped}.

source: Rebuild…
ru: Пересобрать…

source: Request sent to the LLM
ru: Запрос отправлен в LLM

source: Requirements: {rows} × {columns}. Linked {linked} of {pairs} pairs ({coverage:.0%})
ru: Требования: {rows} × {columns}. Связано {linked} из {pairs} пар ({coverage:.0%}).

source: Requirements: {rows} × {columns}. No requirement combinations available
ru: Требования: {rows} × {columns}. Подходящих комбинаций нет

source: Response was regenerated
ru: Ответ пересоздан

source: Result: {value}
ru: Результат: {value}

source: Returned items: {count}
ru: Возвращено элементов: {count}

source: Revision: {revision}
ru: Ревизия: {revision}

source: Row
ru: Строка

source: Row {row}, field {field}: {message}
ru: Строка {row}, поле {field}: {message}

source: Row {row}: {message}
ru: Строка {row}: {message}

source: Rows document
ru: Документ для строк

source: Run batch
ru: Запустить пакет

source: Running
ru: Выполняется

source: Running {current} of {total} requirements (done: {done}, failed: {failed}, cancelled: {cancelled})
ru: Выполняется {current} из {total} требований (готово: {done}, с ошибкой: {failed}, отменено: {cancelled})

source: Select CSV file
ru: Выберите CSV-файл

source: Select a cell or header to view details.
ru: Выберите ячейку или заголовок, чтобы посмотреть детали.

source: Select a cell to view link information.
ru: Выберите ячейку, чтобы увидеть информацию о связях.

source: Select at least one requirement in the list to run a batch
ru: Выберите минимум одно требование в списке, чтобы запустить пакет

source: Select requirements and run a batch
ru: Выберите требования и запустите пакет

source: Selected documents do not contain requirements
ru: В выбранных документах нет требований

source: Showing first {count} row(s)
ru: Показаны первые {count} строк

source: Some requirements failed
ru: Часть требований завершилась с ошибкой

source: Source: {rid}
ru: Источник: {rid}

source: Started at {timestamp}
ru: Запущено в {timestamp}

source: Status: {status}
ru: Статус: {status}

source: Step {index}
ru: Шаг {index}

source: Stop batch
ru: Остановить пакет

source: Hide batch queue
ru: Скрыть очередь пакета

source: Batch processing is still running. Stop and close the queue?
ru: Пакетная обработка ещё выполняется. Остановить и закрыть очередь?

source: Stop batch processing?
ru: Остановить пакетную обработку?

source: System message
ru: Системное сообщение

source: Tags: {tags}
ru: Метки: {tags}

source: Target document: {label}
ru: Целевой документ: {label}

source: Targets: {targets}
ru: Цели: {targets}

source: The selected documents contain no requirements to display.
ru: В выбранных документах нет требований для отображения.

source: The waiting status shows three elements: • The timer reports how long the agent has been running in mm:ss and updates every second. • The status text describes whether the agent is still working or has finished. • The spinning indicator on the left stays active while the agent is still working.
ru: Экран ожидания показывает три элемента: • Таймер отображает, сколько времени агент работает, в формате мм:сс и обновляется каждую секунду. • Статус сообщает, продолжает ли агент работу или уже завершил её. • Индикатор слева крутится, пока агент ещё работает.

source: There are suspect links.
ru: Есть подозрительные связи.

source: Thought {index}
ru: Мысль {index}

source: Timestamp unavailable
ru: Время недоступно

source: Title: {title}
ru: Название: {title}

source: Tokens: {tokens} • Context window: {usage}
ru: Токены: {tokens} • Контекстное окно: {usage}

source: Tool: {tool}
ru: Инструмент: {tool}

source: Total items: {total}
ru: Всего элементов: {total}

source: Total links: {count}
ru: Всего связей: {count}

source: Trace Matrix Configuration
ru: Настройка матрицы трассировки

source: Type: {type}
ru: Тип: {type}

source: Unable to start batch queue
ru: Не удалось запустить очередь пакета

source: Working {time}
ru: Работа {time}

source: Worksheet
ru: Лист

source: Yes
ru: Да

source: [{timestamp}] Context messages:
ru: [{timestamp}] Сообщения контекста:

source: [{timestamp}] LLM request:
ru: [{timestamp}] Запрос к LLM:

source: [{timestamp}] Model reasoning:
ru: [{timestamp}] Рассуждение модели:

source: [{timestamp}] Raw LLM payload:
ru: [{timestamp}] Сырой ответ LLM:

source: [{timestamp}] System message:
ru: [{timestamp}] Системное сообщение:

source: [{timestamp}] Tool call {index}: {tool} — {status}
ru: [{timestamp}] Вызов инструмента {index}: {tool} — {status}

source: [{timestamp}] You:
ru: [{timestamp}] Вы:

source: at least one --columns value is required
ru: нужно указать хотя бы одно значение --columns

source: at least one --rows value is required
ru: нужно указать хотя бы одно значение --rows

source: cannot delete {rid}: revision error: {msg}
ru: нельзя удалить {rid}: ошибка ревизии: {msg}

source: code {code}
ru: код {code}

source: column document prefixes (comma separated)
ru: префиксы документов для столбцов (через запятую)

source: completed
ru: завершено

source: completed successfully
ru: успешно завершено

source: failed
ru: ошибка

source: filter columns by requirement type
ru: фильтровать столбцы по типу требования

source: filter columns by status
ru: фильтровать столбцы по статусу

source: filter rows by requirement type
ru: фильтровать строки по типу требования

source: filter rows by status
ru: фильтровать строки по статусу

source: in progress…
ru: в работе…

source: include descendant documents for columns
ru: включать дочерние документы для столбцов

source: include descendant documents for rows
ru: включать дочерние документы для строк

source: interpretation of links
ru: интерпретация связей

source: keep columns with any of the labels
ru: оставлять столбцы с любой из меток

source: keep rows with any of the labels
ru: оставлять строки с любой из меток

source: keys: {keys}
ru: ключи: {keys}

source: limit column search fields (comma separated)
ru: ограничить поля поиска по столбцам (через запятую)

source: limit row search fields (comma separated)
ru: ограничить поля поиска по строкам (через запятую)

source: n/a
ru: н/д

source: require all labels on columns
ru: требовать все метки на столбцах

source: require all labels on rows
ru: требовать все метки на строках

source: returned data
ru: возвращённые данные

source: row document prefixes (comma separated)
ru: префиксы документов для строк (через запятую)

source: text query for columns
ru: текстовый запрос для столбцов

source: text query for rows
ru: текстовый запрос для строк

source: update
ru: обновление

source: {count} more issue(s) not shown
ru: ещё {count} проблем не показано

source: {index}. Invalid change payload
ru: {index}. Некорректный набор изменений

source: {index}. replace attachments → {value}
ru: {index}. заменить вложения → {value}

source: {index}. replace labels → {value}
ru: {index}. заменить метки → {value}

source: {index}. replace links → {value}
ru: {index}. заменить связи → {value}

source: {index}. set {field} → {value}
ru: {index}. установить {field} → {value}

source: Documentation disabled
ru: Документация отключена

source: — default read limit: {limit} KiB
ru: — лимит чтения по умолчанию: {limit} КиБ

source: Browse…
ru: Обзор…

source: Default from MCP settings: {path}
ru: Значение из настроек MCP: {path}

source: Base path is required for relative folders
ru: Для относительных путей нужна папка требований

source: Invalid documentation path
ru: Некорректный путь к документации

source: {path} (missing)
ru: {path} (не существует)

source: Select documentation folder
ru: Выберите папку документации

source: Documentation directory visible to MCP tools. Example: share Relative paths are resolved from the active requirements folder. Leave empty to disable documentation access.
ru: Каталог документации, доступный инструментам MCP. Пример: share Относительные пути вычисляются от активной папки требований. Оставьте пустым, чтобы отключить доступ к документации.

source: Documentation folder
ru: Папка документации

source: Documentation folder (optional). Relative paths resolve against the current requirements directory when one is open.
ru: Папка документации (необязательно). Относительные пути вычисляются относительно текущего каталога требований, если он открыт.

source: Documentation folder access disabled.
ru: Доступ к папке документации отключён.

source: Documentation folder pending: {path} (open a requirements folder)
ru: Папка документации ожидает: {path} (откройте каталог требований)

source: Documentation folder: {path}
ru: Папка документации: {path}

source: Documentation root: {path}
ru: Корневая папка документации: {path}

source: Documentation root: {path} (missing)
ru: Корневая папка документации: {path} (нет)

source: Maximum amount of documentation text (in KiB) streamed by `read_user_document` when the model omits `max_bytes`. Increase only when necessary; higher limits mean longer MCP responses and more context usage.
ru: Максимальный объём текста документации (в КиБ), который `read_user_document` передаёт, если модель не указывает `max_bytes`. Увеличивайте только при необходимости: больший лимит означает более долгие ответы MCP и больший расход контекста.

source: Project override: {path}
ru: Переопределение проекта: {path}

source: Read chunk limit (KiB)
ru: Лимит чтения блока (КиБ)

source: Content preview: {preview}
ru: Предпросмотр содержимого: {preview}

source: failed to read template {path}: {error}
ru: не удалось прочитать шаблон {path}: {error}

source: invalid template JSON in {path}: {error}
ru: некорректный JSON шаблона в {path}: {error}

source: lines: {lines}, tokens: {tokens}, characters: {characters}
ru: строк: {lines}, токенов: {tokens}, символов: {characters}

source: template file not found: {path}
ru: файл шаблона не найден: {path}

source: template must be a JSON object: {path}
ru: шаблон должен быть JSON-объектом: {path}

source: (empty message)
ru: (пустое сообщение)

source: Agent run failed
ru: Запуск агента завершился ошибкой

source: Also remove the '{key}' label from existing requirements?
ru: Удалить метку «{key}» из существующих требований?

source: Also remove these {count} labels from existing requirements?
ru: Удалить эти {count} метки из существующих требований?

source: Approximately {remaining} bytes remain.
ru: Около {remaining} байт осталось.

source: Archived chat
ru: Архивный чат

source: Copied
ru: Скопировано

source: Encoding detection fell back to {encoding}.
ru: Определение кодировки переключилось на {encoding}.

source: Encoding: {encoding}
ru: Кодировка: {encoding}

source: Error code: {code}
ru: Код ошибки: {code}

source: File is empty; default encoding applied.
ru: Файл пуст; применена кодировка по умолчанию.

source: Hint: {details}
ru: Подсказка: {details}

source: Increase `max_bytes` to capture the remainder of the truncated line.
ru: Увеличьте `max_bytes`, чтобы получить остаток обрезанной строки.

source: Label key cannot be empty
ru: Ключ метки не может быть пустым

source: Message queued — it will run after the current response.
ru: Сообщение поставлено в очередь — оно выполнится после текущего ответа.

source: Move
ru: Переместить

source: Move or copy requirements
ru: Переместить или копировать требования

source: Move or copy…
ru: Переместить или копировать…

source: Moved
ru: Перемещено

source: Next for {chat}: {prompt}
ru: Следующее для {chat}: {prompt}

source: Next for {chat}: {prompt} (+{count} more)
ru: Следующее для {chat}: {prompt} (ещё +{count})

source: Next message queued
ru: Следующее сообщение поставлено в очередь

source: Operation
ru: Операция

source: Queued at {time} for chat {chat}: {prompt}
ru: Поставлено в очередь {time} для чата {chat}: {prompt}

source: Queued message removed.
ru: Сообщение из очереди удалено.

source: Remove the queued message
ru: Удалить сообщение из очереди

source: Request the next chunk with `max_bytes≤{limit}` using `read_user_document`.
ru: Запросите следующий блок через `read_user_document`, указав `max_bytes≤{limit}`.

source: Reset revision to 1 in copies
ru: Сбрасывать ревизию до 1 в копиях

source: Select a different document when moving requirements.
ru: Выберите другой документ при перемещении требований.

source: Select a target document.
ru: Выберите целевой документ.

source: Selected requirements: {count}
ru: Выбрано требований: {count}

source: Sending queued message for {chat}…
ru: Отправляем сообщение из очереди для {chat}…

source: Switch to target document after completion
ru: Переключиться на целевой документ после завершения

source: Target document
ru: Целевой документ

source: The previous chunk ended mid-line; a higher `max_bytes` may be required.
ru: Предыдущий блок закончился посреди строки; может потребоваться больший `max_bytes`.

source: To continue reading, call `read_user_document` with `start_line={start}` and `max_bytes≤{limit}`.
ru: Чтобы продолжить чтение, вызовите `read_user_document` с `start_line={start}` и `max_bytes≤{limit}`.

source: To continue reading, call `read_user_document` with `start_line={start}`.
ru: Чтобы продолжить чтение, вызовите `read_user_document` с `start_line={start}`.

source: Transfer completed
ru: Передача завершена

source: Transfer failed
ru: Передача не удалась

source: Update requirements
ru: Обновить требования

source: Update requirements using '{old}' to '{new}'?
ru: Обновить требования, заменив «{old}» на «{new}»?

source: pending
ru: ожидает

source: {action} {count} requirement(s) to {prefix}.
ru: {action} {count} требование(я) в {prefix}.

source: &Export Requirements…
ru: &Экспорт требований…

source: Choose at least one column to export.
ru: Выберите хотя бы один столбец для экспорта.

source: Export
ru: Экспорт

source: Export blocked
ru: Экспорт заблокирован

source: Export completed
ru: Экспорт завершён

source: Export failed
ru: Экспорт не выполнен

source: Export format
ru: Формат экспорта

source: Export Requirements
ru: Экспорт требований

source: Exported {count} requirement(s). File: {filename} Open export folder?
ru: Экспортировано требований: {count}. Файл: {filename} Открыть папку экспорта?

source: Could not open export folder: %s
ru: Не удалось открыть папку экспорта: %s

source: Move Down
ru: Вниз

source: Move Up
ru: Вверх

source: No requirements to export.
ru: Нет требований для экспорта.

source: Plain text (.txt)
ru: Текст (.txt)

source: Requirements export — {label}
ru: Экспорт требований — {label}

source: Select All
ru: Выбрать всё

source: Select export file
ru: Выберите файл экспорта

source: Select export file first.
ru: Сначала выберите файл экспорта.

source: Show empty fields as {placeholder}
ru: Показывать незаполненные поля как {placeholder}

source: Card options
ru: Параметры карточек

source: Card sort order
ru: Порядок сортировки карточек

source: Requirement number
ru: Номер требования

source: Label grouping
ru: Группировка по меткам

source: One group per label (duplicate requirement in every matched label)
ru: Одна группа на метку (требование дублируется в каждой подходящей метке)

source: One group per exact label set
ru: Одна группа на точный набор меток

source: DOCX formulas
ru: Формулы DOCX

source: Print requirement heading before each card
ru: Печатать заголовок требования перед каждой карточкой

source: Plain text
ru: Обычный текст

source: Export file path
ru: Путь к файлу экспорта

source: Word (.docx)
ru: Документ Word (.docx)

source: (not set)
ru: (не задано)

source: Text files (*.txt)|*.txt|HTML files (*.html)|*.html|DOCX files (*.docx)|*.docx|CSV files (*.csv)|*.csv|TSV files (*.tsv)|*.tsv|All files|*.*
ru: Текстовые файлы (*.txt)|*.txt|HTML файлы (*.html)|*.html|DOCX файлы (*.docx)|*.docx|CSV файлы (*.csv)|*.csv|TSV файлы (*.tsv)|*.tsv|Все файлы|*.*

source: CSV (.csv)
ru: Таблица CSV (.csv)

source: TSV (.tsv)
ru: Таблица TSV (.tsv)

source: Type
ru: Тип

source: Revision
ru: Ревизия

source: Statement
ru: Формулировка

source: Acceptance
ru: Критерии приемки

source: Related requirements
ru: Связанные требования

source: missing
ru: отсутствует

source: suspect
ru: подозрительная связь

source: Generated at
ru: Сформировано

source: for documents
ru: для документов

source: (no title)
ru: (без названия)

source: Unsaved changes
ru: Несохранённые изменения

source: Save unsaved changes?
ru: Сохранить несохранённые изменения?

source: Save unsaved changes for {requirement}?
ru: Сохранить несохранённые изменения для {requirement}?

source: Keep without saving
ru: Оставить без сохранения

source: (empty event log)
ru: (журнал событий пуст)

source: Agent (step {step}): tool call {index}: {tool} — {status}
ru: Агент (шаг {step}): вызов инструмента {index}: {tool} — {status}

source: All requirements
ru: Все требования

source: Attachment: {name}
ru: Вложение: {name}

source: Color label backgrounds (HTML/DOCX)
ru: Окрашивать фон меток (HTML/DOCX)

source: Delete attachment
ru: Удалить вложение

source: Delete attachment file? {path}
ru: Удалить файл вложения? {path}

source: Event ({kind}):
ru: Событие ({kind}):

source: Failed to delete attachment file: {path}
ru: Не удалось удалить файл вложения: {path}

source: Image
ru: Изображение

source: Information
ru: Информация

source: Model reasoning (step {index})
ru: Рассуждение модели (шаг {index})

source: Opened folder "{path}". No requirement documents were found. This looks like a new directory; create a document to start.
ru: Открыта папка "{path}". Документы требований не найдены. Похоже, это новый каталог; создайте документ, чтобы начать.

source: Preview:
ru: Предпросмотр:

source: Requirements to export
ru: Требования для экспорта

source: Select a document before adding attachments.
ru: Выберите документ перед добавлением вложений.

source: Select image
ru: Выберите изображение

source: Selected requirements
ru: Выбранные требования

source: Size: {size} • Tokens: {tokens}
ru: Размер: {size} • Токены: {tokens}

source: Skip
ru: Пропустить

source: Visible requirements (respect current filter)
ru: Видимые требования (с учетом текущего фильтра)

source: Without labels
ru: Без меток

source: attachment id is required
ru: необходим id вложения

source: attachment path is required
ru: необходим путь вложения

source: attachments must be a list of objects
ru: attachments должен быть списком объектов

source: {action} failed for {rid}: {error}
ru: {action} завершилось ошибкой для {rid}: {error}

source: {action} failed: {error}
ru: {action} завершилось ошибкой: {error}

source: | Column | Value | | --- | --- | | Item | Description |
ru: | Колонка | Значение | | --- | --- | | Элемент | Описание |

source: Failed to load requirements folder. Selected folder: {path} Details: {error}
ru: Не удалось загрузить папку требований. Выбранная папка: {path} Подробности: {error}

source: Selected folder "{selected}" is the "{nested}" subfolder of document "{document}"; open requirements root "{target}".
ru: Вы выбрали подпапку "{nested}" документа "{document}" ("{selected}"); откройте корневую папку требований "{target}".

source: Selected folder "{selected}" stores internal CookaReq data; open parent folder "{target}".
ru: Выбранная папка "{selected}" содержит служебные данные CookaReq; откройте родительскую папку "{target}".

source: Selected folder "{selected}" looks like a single document; open parent folder "{target}".
ru: Выбранная папка "{selected}" похожа на папку одного документа; откройте родительскую папку "{target}".

source: Selected folder "{selected}" is one level above requirements root; open "{target}".
ru: Выбранная папка "{selected}" на уровень выше корня требований; откройте "{target}".

source: Selected folder "{selected}" is above several requirement roots ({options}); open the exact folder that directly contains document directories.
ru: Выбранная папка "{selected}" находится выше нескольких корней требований ({options}); откройте точную папку, которая непосредственно содержит директории документов.

source: Automatic (OMML, then SVG/PNG fallback)
ru: Автоматически (OMML, затем резервно SVG/PNG)

source: Columns sort field
ru: Поле сортировки столбцов

source: Copy health
ru: Копировать отчёт о состоянии

source: Could not access clipboard
ru: Не удалось получить доступ к буферу обмена

source: Could not access the clipboard.
ru: Не удалось получить доступ к буферу обмена.

source: Coverage: {linked}/{total} cells ({coverage:.0%}) Suspect cells: {suspect_cells}/{linked} ({suspect_ratio:.0%}) Suspect links: {suspect_links}
ru: Покрытие: {linked}/{total} ячеек ({coverage:.0%}) Подозрительные ячейки: {suspect_cells}/{linked} ({suspect_ratio:.0%}) Подозрительные связи: {suspect_links}

source: Display and export options
ru: Параметры отображения и экспорта

source: Done
ru: Готово

source: Export trace matrix
ru: Экспортировать матрицу трассировки

source: Export…
ru: Экспорт…

source: Health report copied to clipboard
ru: Отчёт о состоянии скопирован в буфер обмена

source: Hide unlinked rows/columns
ru: Скрывать несвязанные строки/столбцы

source: Interactive matrix window
ru: Интерактивное окно матрицы

source: Linked from
ru: Связано из

source: Modified At
ru: Изменено

source: Orphan columns: {columns}
ru: Столбцы без связей: {columns}

source: Orphan rows: {rows}
ru: Строки без связей: {rows}

source: Output format
ru: Формат вывода

source: Requirement card fields (headers/details/export)
ru: Поля карточки требования (заголовки/детали/экспорт)

source: Rows sort field
ru: Поле сортировки строк
